src/cf/InformationRegisters/ТелеграмНастройкиБотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмНастройкиБотов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смещение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТелеграмНастройкиБотов/Ext/ManagerModule.bsl
Процедура СохранитьНастройкиБота(НакопленныеДанные) Экспорт
	
	Бот = НакопленныеДанные.ДанныеБота.Бот;
	ИдентификаторОбновления = НакопленныеДанные.ИдентификаторОбновления;
	
	Если ТипЗнч(ИдентификаторОбновления) = Тип("Число") Тогда
		МенеджерЗаписи = РегистрыСведений.ТелеграмНастройкиБотов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Бот 		= Бот;
		МенеджерЗаписи.Смещение = ИдентификаторОбновления;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры
